[
    {
        "id": 1,
        "subject": "Damaged Blender",
        "description": "The blender I received has a crack in the base. Can I get a replacement?",
        "priority": "high",
        "status": "open",
        "comments": [
        {
            "author": "customer",
            "content": "I just received my blender and noticed a crack in the base. Can I get a replacement sent out?"
        },
        {
            "author": "agent",
            "content": "I'm sorry to hear about the damaged blender. Could you please provide your order number and a photo of the damaged base?"
        },
        {
            "author": "customer",
            "content": "Sure, my order number is #BL-5678. Here's a photo of the crack [photo attached]."
        },
        {
            "author": "agent",
            "content": "Thank you for providing that information. I've initiated a replacement order for you. You should receive a shipping confirmation within 24 hours."
        },
        {
            "author": "customer",
            "content": "Great, thank you! What should I do with the damaged blender?"
        }
        ]
    },
    {
        "id": 2,
        "subject": "Knife Set Recommendation",
        "description": "I'm a beginner cook. Which knife set would you recommend for everyday use?",
        "priority": "low",
        "status": "closed",
        "comments": [
        {
            "author": "customer",
            "content": "I'm new to cooking and looking for a good knife set. What would you recommend for everyday use?"
        },
        {
            "author": "agent",
            "content": "For beginners, we often recommend our 'Essential 3-Piece Knife Set'. It includes a chef's knife, paring knife, and serrated knife - covering most of your basic needs. Would you like more details on this set?"
        },
        {
            "author": "customer",
            "content": "That sounds perfect! Could you tell me more about the quality and price?"
        },
        {
            "author": "agent",
            "content": "Certainly! The set is made from high-quality stainless steel and comes with a lifetime warranty. It's priced at $89.99, which is great value for the quality. Would you like a link to the product page?"
        },
        {
            "author": "customer",
            "content": "Yes, please send me the link. I think I'll go ahead and order it. Thanks for your help!"
        },
        {
            "author": "agent",
            "content": "You're welcome! I'm glad I could assist. Here's the link: [product link]. If you have any more questions, don't hesitate to ask. Enjoy your new knife set!"
        }
        ]
    },
    {
        "id": 3,
        "subject": "Missing Parts in Food Processor",
        "description": "My new food processor is missing the slicing disc. How can I get the missing part?",
        "priority": "medium",
        "status": "pending",
        "comments": [
        {
            "author": "customer",
            "content": "I just unpacked my new food processor and the slicing disc is missing. How can I get this part?"
        },
        {
            "author": "agent",
            "content": "I apologize for the inconvenience. Could you please provide your order number so I can look into this for you?"
        },
        {
            "author": "customer",
            "content": "Sure, it's order #FP-9876."
        },
        {
            "author": "agent",
            "content": "Thank you. I've located your order and I'm arranging for the missing slicing disc to be sent to you right away. Is the address on the order still correct for shipping?"
        },
        {
            "author": "customer",
            "content": "Yes, that address is correct. How long will it take to arrive?"
        },
        {
            "author": "agent",
            "content": "The replacement part should arrive within 3-5 business days. I'll send you a tracking number as soon as it ships. Is there anything else I can help you with?"
        },
        {
            "author": "customer",
            "content": "No, that's all. Thanks for your quick response!"
        },
        {
            "author": "agent",
            "content": "You're welcome! I'm glad I could help. Once you receive the part, please let us know if you need any assistance with installation. Have a great day!"
        }
        ]
    },
    {
        "id": 4,
        "subject": "Return Policy Query",
        "description": "What's your return policy for unused items? I bought a pot that's too large for my needs.",
        "priority": "low",
        "status": "closed",
        "comments": [
        {
            "author": "customer",
            "content": "I recently purchased a pot that's too large for my needs. What's your return policy for unused items?"
        },
        {
            "author": "agent",
            "content": "We have a 30-day return policy for unused items in their original packaging. As long as the pot hasn't been used and is in its original condition, you can return it for a full refund. Would you like me to guide you through the return process?"
        },
        {
            "author": "customer",
            "content": "Yes, please. How do I initiate the return?"
        },
        {
            "author": "agent",
            "content": "To initiate the return, please log into your account on our website, go to your order history, and select 'Return Item' next to the pot. You'll receive a prepaid return label via email. Pack the pot securely and attach the label to the package. Once we receive and process the return, we'll issue a refund to your original payment method."
        },
        {
            "author": "customer",
            "content": "Great, thank you. I'll do that right away."
        },
        {
            "author": "agent",
            "content": "You're welcome! If you have any issues with the return process, please don't hesitate to reach out. Is there anything else I can help you with today?"
        },
        {
            "author": "customer",
            "content": "No, that's all. Thanks for your help!"
        },
        {
            "author": "agent",
            "content": "You're welcome! Have a great day, and thank you for shopping with us."
        }
        ]
    },
    {
        "id": 5,
        "subject": "Induction Cooktop Compatibility",
        "description": "Are your stainless steel pans compatible with induction cooktops?",
        "priority": "low",
        "status": "closed",
        "comments": [
        {
            "author": "customer",
            "content": "I'm considering buying your stainless steel pans, but I have an induction cooktop. Are they compatible?"
        },
        {
            "author": "agent",
            "content": "Great question! Most of our stainless steel pans are indeed compatible with induction cooktops. They have a magnetic stainless steel base that works well with induction technology. Which specific pan or set were you interested in?"
        },
        {
            "author": "customer",
            "content": "I was looking at the 'Pro Chef 10-piece Stainless Steel Cookware Set'. Is that one compatible?"
        },
        {
            "author": "agent",
            "content": "Yes, the 'Pro Chef 10-piece Stainless Steel Cookware Set' is fully compatible with induction cooktops. All pieces in this set have a tri-ply construction with a magnetic stainless steel exterior, making them perfect for induction cooking."
        },
        {
            "author": "customer",
            "content": "That's exactly what I needed to know. Thank you!"
        },
        {
            "author": "agent",
            "content": "You're welcome! I'm glad I could help. If you have any more questions about the set or need cooking tips for induction cooktops, feel free to ask. Happy cooking!"
        }
        ]
    },
    {
        "id": 6,
        "subject": "Delayed Shipment",
        "description": "My order #45678 was supposed to arrive yesterday. Can you check its status?",
        "priority": "high",
        "status": "open",
        "comments": [
        {
            "author": "customer",
            "content": "I'm concerned about my order #45678. It was supposed to arrive yesterday, but I haven't received it. Can you check on its status?"
        },
        {
            "author": "agent",
            "content": "I apologize for the delay with your order. Let me look into this for you right away. Can you please confirm the last four digits of the phone number associated with the order?"
        },
        {
            "author": "customer",
            "content": "Sure, it's 5432."
        },
        {
            "author": "agent",
            "content": "Thank you for confirming. I've checked your order status, and I see that there was a slight delay at our distribution center. The good news is that your package has now been shipped. According to the tracking information, it should be delivered tomorrow by end of day. Would you like me to send you the tracking number?"
        },
        {
            "author": "customer",
            "content": "Yes, please send me the tracking number. I'm a bit disappointed about the delay, though."
        }
        ]
    },
    {
        "id": 7,
        "subject": "Recipe Book Inquiry",
        "description": "Do you sell any recipe books specifically for air fryer cooking?",
        "priority": "low",
        "status": "closed",
        "comments": [
        {
            "author": "customer",
            "content": "I recently bought an air fryer from your store and I'm looking for recipe ideas. Do you sell any recipe books specifically for air fryer cooking?"
        },
        {
            "author": "agent",
            "content": "Thank you for your inquiry! Yes, we do carry several recipe books for air fryer cooking. Our most popular one is 'Air Fryer Delights: 150 Crispy, Healthy Recipes'. Would you like more information about this book?"
        },
        {
            "author": "customer",
            "content": "That sounds perfect! Can you tell me more about what kinds of recipes are included?"
        },
        {
            "author": "agent",
            "content": "Certainly! 'Air Fryer Delights' includes a wide variety of recipes, from appetizers and main courses to desserts. It covers cuisines from around the world and has options for various dietary needs, including vegetarian and gluten-free recipes. The book also includes a guide to air fryer basics and tips for getting the best results."
        },
        {
            "author": "customer",
            "content": "Great! How much does it cost, and is it available for immediate shipping?"
        },
        {
            "author": "agent",
            "content": "The book is priced at $24.99, and yes, it is in stock and available for immediate shipping. Would you like to place an order for it?"
        },
        {
            "author": "customer",
            "content": "Yes, I'd like to order it. Can I use the same account I used for my air fryer purchase?"
        },
        {
            "author": "agent",
            "content": "Absolutely! I can place the order for you right now using your account. I've added the book to your cart and applied free shipping since you're a recent customer. Your total comes to $24.99. Shall I proceed with the purchase using the payment method on file?"
        },
        {
            "author": "customer",
            "content": "Yes, please go ahead. Thank you for your help!"
        },
        {
            "author": "agent",
            "content": "You're welcome! I've completed your order. You'll receive a confirmation email shortly, and the book should arrive within 3-5 business days. Is there anything else I can assist you with today?"
        },
        {
            "author": "customer",
            "content": "No, that's all. Thanks again!"
        },
        {
            "author": "agent",
            "content": "It's my pleasure! Enjoy your new recipe book and happy air frying!"
        }
        ]
    },
    {
        "id": 8,
        "subject": "Faulty Coffee Grinder",
        "description": "The coffee grinder I bought last week has stopped working. What should I do?",
        "priority": "medium",
        "status": "open",
        "comments": [
        {
            "author": "customer",
            "content": "I purchased a coffee grinder from your store last week, but it has suddenly stopped working. What are my options?"
        },
        {
            "author": "agent",
            "content": "I'm sorry to hear that your coffee grinder isn't working properly. I'd be happy to help you resolve this issue. Could you please provide me with your order number and describe what happens when you try to use the grinder?"
        },
        {
            "author": "customer",
            "content": "My order number is CG-7890. When I press the button to start grinding, I hear a humming noise, but the blades don't spin."
        },
        {
            "author": "agent",
            "content": "Thank you for that information. It sounds like there might be an issue with the motor or the connection to the blades. Since the product is still under warranty, we can either send you a replacement or have you return it for repair. Which would you prefer?"
        },
        {
            "author": "customer",
            "content": "I'd prefer a replacement if possible. How long would that take?"
        },
        {
            "author": "agent",
            "content": "Certainly, I can arrange a replacement for you. We'll ship it out within 1-2 business days, and it should arrive within 3-5 business days after that. I'll also send you a prepaid return label for the faulty grinder. Could you please confirm your current shipping address?"
        },
        {
            "author": "customer",
            "content": "Yes, my address is still 123 Coffee Lane, Beantown, ST 12345."
        }
        ]
    },
    {
        "id": 9,
        "subject": "Bulk Order Discount",
        "description": "I'm opening a small café. Do you offer discounts for bulk orders of dishes and cutlery?",
        "priority": "medium",
        "status": "pending",
        "comments": [
        {
            "author": "customer",
            "content": "Hello, I'm in the process of opening a small café and I need to purchase dishes and cutlery in bulk. Do you offer any discounts for large orders?"
        },
        {
            "author": "agent",
            "content": "Congratulations on your new café! Yes, we do offer discounts for bulk orders. The discount varies depending on the total order value and the specific items. Could you give me an idea of what items you're interested in and roughly how many of each?"
        },
        {
            "author": "customer",
            "content": "I'm looking at your 'Bistro Collection' line. I'd need about 100 each of dinner plates, salad plates, bowls, coffee cups, and saucers. Also, about 150 sets of cutlery."
        },
        {
            "author": "agent",
            "content": "Thank you for providing those details. For an order of that size in our 'Bistro Collection' line, we can offer a 15% discount on the dishes and a 10% discount on the cutlery. Would you like me to put together a detailed quote for you?"
        },
        {
            "author": "customer",
            "content": "That sounds great! Yes, please send me a detailed quote. Can you also include information about durability and if these are commercial dishwasher safe?"
        },
        {
            "author": "agent",
            "content": "Absolutely! I'll prepare a comprehensive quote including the discounts, along with information about the durability and dishwasher compatibility of the 'Bistro Collection'. The items are indeed commercial dishwasher safe and designed for heavy use in food service environments. I'll email this to you within the next hour. Is there a specific email address you'd like me to send it to?"
        },
        {
            "author": "customer",
            "content": "Perfect, thank you. Please send it to cafe@example.com."
        },
        {
            "author": "agent",
            "content": "You're welcome! I'll send the quote to cafe@example.com within the hour. After you've had a chance to review it, please feel free to reach out if you have any questions or if you'd like to proceed with the order. Is there anything else I can help you with today?"
        },
        {
            "author": "customer",
            "content": "No, that's all for now. I appreciate your help!"
        },
        {
            "author": "agent",
            "content": "It's my pleasure! I look forward to potentially helping you outfit your new café. Best of luck with your new business venture!"
        }
        ]
    },
    {
        "id": 10,
        "subject": "Product Dimensions",
        "description": "Can you provide the exact dimensions of the large cutting board (item #BD-2345)?",
        "priority": "low",
        "status": "closed",
        "comments": [
        {
            "author": "customer",
            "content": "I'm interested in your large cutting board (item #BD-2345), but I need to know if it will fit in my kitchen drawer. Can you give me the exact dimensions?"
        },
        {
            "author": "agent",
            "content": "Of course! I'd be happy to provide you with the dimensions of our large cutting board (item #BD-2345). Let me look that up for you right away."
        },
        {
            "author": "agent",
            "content": "The dimensions of the large cutting board (item #BD-2345) are as follows: Length: 18 inches (45.72 cm), Width: 12 inches (30.48 cm), Thickness: 1 inch (2.54 cm). Does this help with determining if it will fit in your kitchen drawer?"
        },
        {
            "author": "customer",
            "content": "Yes, that's exactly what I needed to know. It looks like it will fit perfectly. Can you tell me what material it's made from?"
        },
        {
            "author": "agent",
            "content": "I'm glad the dimensions work for you! The cutting board is made from sustainable bamboo, which is known for its durability and natural antibacterial properties. It's also gentle on knife edges. Would you like more information about care instructions or pricing?"
        },
        {
            "author": "customer",
            "content": "The bamboo material sounds great. Yes, please let me know about the care instructions and price."
        },
        {
            "author": "agent",
            "content": "Certainly! The cutting board is priced at $39.99. As for care instructions, we recommend hand washing with warm soapy water and drying immediately after use. To maintain its quality, occasionally treat it with food-grade mineral oil. Avoid soaking it in water or putting it in the dishwasher. Would you like to proceed with purchasing this cutting board?"
        },
        {
            "author": "customer",
            "content": "Thanks for all the information. I think I'll go ahead and buy it. Can I order it through you?"
        },
        {
            "author": "agent",
            "content": "Absolutely! I'd be happy to place the order for you. I can use the account information you're currently logged in with. Shall I proceed with the purchase using the payment method and shipping address on file?"
        },
        {
            "author": "customer",
            "content": "Yes, please go ahead."
        },
        {
            "author": "agent",
            "content": "Great! I've placed the order for the large bamboo cutting board (item #BD-2345). Your total comes to $39.99 plus applicable taxes. You'll receive an order confirmation email shortly, and the cutting board should arrive within 5-7 business days. Is there anything else I can help you with today?"
        },
        {
            "author": "customer",
            "content": "No, that's all. Thank you for your help!"
        },
        {
            "author": "agent",
            "content": "You're welcome! Thank you for your purchase. We hope you enjoy your new cutting board. If you have any questions once you receive it, please don't hesitate to reach out. Have a great day!"
        }
        ]
    },
    {
        "id": 11,
        "subject": "Gift Wrapping Service",
        "description": "Do you offer gift wrapping for purchases? I'd like to send a set of pans as a housewarming gift.",
        "priority": "low",
        "status": "closed",
        "comments": [
          {
            "author": "customer",
            "content": "Hi, I'm planning to send a set of pans as a housewarming gift. Do you offer gift wrapping services?"
          },
          {
            "author": "agent",
            "content": "Hello! Yes, we do offer gift wrapping services for most of our products, including pan sets. There's a small additional fee of $5 for this service. Would you like me to add gift wrapping to your order?"
          },
          {
            "author": "customer",
            "content": "That sounds great! Yes, please add gift wrapping. Can I also include a personalized message?"
          },
          {
            "author": "agent",
            "content": "Absolutely! We'd be happy to include a personalized message with your gift. You can add a message of up to 50 characters. What would you like the message to say?"
          },
          {
            "author": "customer",
            "content": "Perfect! Please make the message: 'Enjoy cooking in your new home! Love, Sarah.'"
          },
          {
            "author": "agent",
            "content": "Wonderful! I've added the gift wrapping service and your personalized message to the order. Is there anything else you'd like to add or modify with this purchase?"
          },
          {
            "author": "customer",
            "content": "No, that's all. Thank you for your help!"
          },
          {
            "author": "agent",
            "content": "You're welcome! I'm glad I could assist you. Your thoughtful gift will be beautifully wrapped with your personalized message. The recipient will surely appreciate it. If you need anything else, don't hesitate to ask. Have a great day!"
          }
        ]
      },
      {
        "id": 12,
        "subject": "Warranty Information",
        "description": "What's the warranty period for your electric kettles?",
        "priority": "low",
        "status": "closed",
        "comments": [
          {
            "author": "customer",
            "content": "I'm considering buying one of your electric kettles. Could you tell me about the warranty?"
          },
          {
            "author": "agent",
            "content": "Certainly! Our electric kettles come with a 2-year limited warranty from the date of purchase. This covers defects in materials and workmanship under normal home use. Can I provide you with more specific details about what's covered?"
          },
          {
            "author": "customer",
            "content": "Yes, please. Does it cover things like the heating element failing?"
          },
          {
            "author": "agent",
            "content": "Absolutely. The warranty covers functional parts like the heating element, auto shut-off mechanism, and power base. If these fail due to defects in materials or workmanship, we'll repair or replace the kettle free of charge. However, the warranty doesn't cover damage from accidents, misuse, or normal wear and tear."
          },
          {
            "author": "customer",
            "content": "That's helpful, thanks. How would I make a claim if I needed to?"
          },
          {
            "author": "agent",
            "content": "To make a warranty claim, you would need to contact our customer service department with your proof of purchase. We'll guide you through the process, which usually involves sending the product back to us for inspection. If the issue is covered under warranty, we'll repair or replace it and cover the shipping costs back to you."
          },
          {
            "author": "customer",
            "content": "Great, that all sounds good. I think I'm ready to make a purchase."
          },
          {
            "author": "agent",
            "content": "Excellent! I'm glad I could help clarify our warranty policy. Is there a particular model you're interested in, or would you like some recommendations based on your needs?"
          }
        ]
      },
      {
        "id": 13,
        "subject": "Incorrect Item Received",
        "description": "I ordered a red mixer but received a blue one. How can I exchange it?",
        "priority": "high",
        "status": "open",
        "comments": [
          {
            "author": "customer",
            "content": "I just received my order, but there's a problem. I ordered a red stand mixer, but the one I got is blue. How can I get this sorted out?"
          },
          {
            "author": "agent",
            "content": "I'm very sorry to hear about this mix-up with your order. I'd be happy to help you resolve this issue. Could you please provide your order number so I can look into this for you?"
          },
          {
            "author": "customer",
            "content": "Sure, my order number is SM-9876."
          },
          {
            "author": "agent",
            "content": "Thank you for providing that information. I've located your order, and I see that you did indeed order the red model. I sincerely apologize for this error. We can definitely arrange an exchange for you. Would you prefer that we send out the correct red mixer first and then you can return the blue one, or would you rather return the blue one first?"
          },
          {
            "author": "customer",
            "content": "I'd prefer if you could send out the red one first, if possible. I was planning to use it this weekend."
          },
          {
            "author": "agent",
            "content": "Absolutely, I understand. I'll arrange for the red mixer to be shipped out to you right away with expedited shipping at no extra cost to you. You should receive it within 2-3 business days. I'll also email you a prepaid return label for the blue mixer. Once you receive the red one, please use this label to return the blue mixer within 14 days. Does this sound okay to you?"
          },
          {
            "author": "customer",
            "content": "Yes, that sounds great. Thank you for handling this so quickly."
          },
          {
            "author": "agent",
            "content": "You're welcome. I'm glad we could find a solution that works for you. You'll receive an email confirmation of the new shipment along with the return label shortly. Is there anything else I can assist you with today?"
          }
        ]
      },
      {
        "id": 14,
        "subject": "Rusty Cast Iron Skillet",
        "description": "My cast iron skillet has developed rust spots. Is this covered under warranty?",
        "priority": "medium",
        "status": "pending",
        "comments": [
          {
            "author": "customer",
            "content": "I bought a cast iron skillet from you about a month ago, and it's already developing rust spots. Isn't this covered under warranty?"
          },
          {
            "author": "agent",
            "content": "I'm sorry to hear about the rust on your cast iron skillet. Cast iron can indeed develop rust if not properly seasoned or if exposed to moisture for extended periods. While our warranty covers defects in materials and workmanship, it doesn't typically cover rust as it's often a result of care and maintenance. However, I'd be happy to help you address this issue. Could you tell me a bit about how you've been caring for the skillet?"
          },
          {
            "author": "customer",
            "content": "I've been washing it with soap and water after each use and letting it air dry. Is that not correct?"
          },
          {
            "author": "agent",
            "content": "Thank you for sharing that. Actually, soap can strip the seasoning from cast iron, making it more prone to rust. For cast iron, it's best to clean with hot water and a stiff brush, dry immediately with a clean cloth or paper towel, and then apply a light coat of oil. This helps maintain the seasoning and prevent rust. Would you like me to give you step-by-step instructions on how to remove the rust and re-season your skillet?"
          },
          {
            "author": "customer",
            "content": "Oh, I didn't know that. Yes, please give me those instructions."
          },
          {
            "author": "agent",
            "content": "Of course! Here's how you can remove the rust and re-season your skillet:\n\n1. Scrub the rusty areas with steel wool or a metal scrubber.\n2. Wash the skillet with hot water and mild dish soap, then dry thoroughly.\n3. Apply a thin layer of vegetable oil or melted shortening all over the skillet.\n4. Place the skillet upside down in an oven preheated to 350°F (175°C).\n5. Bake for one hour, then turn off the oven and let the skillet cool inside.\n\nRepeat this process 2-3 times for the best results. After this, follow the care instructions I mentioned earlier. Does this help?"
          },
          {
            "author": "customer",
            "content": "Yes, that's very helpful. I'll try this method. Thank you for the detailed instructions."
          },
          {
            "author": "agent",
            "content": "You're welcome! I'm glad I could help. If you have any trouble with the process or if the rust persists after trying these steps, please don't hesitate to contact us again. We want to ensure you're able to enjoy your cast iron skillet for years to come. Is there anything else I can assist you with today?"
          },
          {
            "author": "customer",
            "content": "No, that's all for now. Thanks again for your help!"
          },
          {
            "author": "agent",
            "content": "You're very welcome! I'm happy I could assist you. Don't hesitate to reach out if you have any more questions about caring for your cookware. Have a great day, and enjoy cooking with your newly seasoned skillet!"
          }
        ]
      },
      {
        "id": 15,
        "subject": "Promotional Code Not Working",
        "description": "I'm trying to use the promo code 'SUMMER25' but it's not applying to my cart. Can you help?",
        "priority": "medium",
        "status": "open",
        "comments": [
          {
            "author": "customer",
            "content": "Hi, I'm trying to place an order using the promotional code 'SUMMER25', but it's not working. Can you help me with this?"
          },
          {
            "author": "agent",
            "content": "Hello! I'm sorry to hear you're having trouble with the promotional code. I'd be happy to help you with this. First, could you confirm a few things for me? Are you sure the code is entered in all capital letters, and are all the items in your cart eligible for the promotion?"
          },
          {
            "author": "customer",
            "content": "Yes, I've entered it in all caps. I'm not sure about the eligibility though. How can I check that?"
          },
          {
            "author": "agent",
            "content": "Thank you for confirming. To check eligibility, you can look at the product descriptions. Items eligible for the SUMMER25 promotion will have a note saying 'Eligible for SUMMER25 discount'. Alternatively, I can check this for you if you provide me with the items in your cart."
          },
          {
            "author": "customer",
            "content": "I have a set of stainless steel pots and pans, and a knife block set in my cart."
          },
          {
            "author": "agent",
            "content": "Thank you for that information. I've checked, and both of these items should be eligible for the SUMMER25 promotion. Let me look into why the code isn't working. Could you please try clearing your browser cache and cookies, then attempt to apply the code again? If that doesn't work, I'll need to escalate this to our technical team."
          },
          {
            "author": "customer",
            "content": "I've tried clearing my cache and cookies, but it's still not working."
          },
          {
            "author": "agent",
            "content": "I apologize for the continued issue. Since the problem persists, I'm going to escalate this to our technical team right away. They'll investigate why the promotional code isn't applying correctly. In the meantime, I don't want you to miss out on this offer. Would you like me to manually place the order for you with the discount applied?"
          }
        ]
      },
      {
        "id": 16,
        "subject": "Product Availability",
        "description": "When will the copper cookware set be back in stock?",
        "priority": "low",
        "status": "closed",
        "comments": [
          {
            "author": "customer",
            "content": "I've been eyeing your copper cookware set, but it's been out of stock for a while. Do you know when it will be available again?"
          },
          {
            "author": "agent",
            "content": "Thank you for your interest in our copper cookware set. I'd be happy to check on its availability for you. Could you please provide the specific product code or name of the set you're looking at?"
          },
          {
            "author": "customer",
            "content": "It's the 10-piece Luxe Copper Set, I believe the product code is CC-1000."
          },
          {
            "author": "agent",
            "content": "Thank you for that information. I've checked our inventory system, and I'm pleased to inform you that the Luxe Copper Set (CC-1000) is scheduled to be back in stock next week, specifically on Tuesday. Would you like me to set up a notification for you when it becomes available?"
          },
          {
            "author": "customer",
            "content": "Yes, that would be great! Please set up the notification."
          },
          {
            "author": "agent",
            "content": "Certainly! I've set up an email notification for you. You'll receive an alert as soon as the Luxe Copper Set is back in stock. Is there anything else I can help you with today?"
          },
          {
            "author": "customer",
            "content": "No, that's all I needed. Thank you for your help!"
          },
          {
            "author": "agent",
            "content": "You're welcome! I'm glad I could assist you. Don't hesitate to reach out if you have any more questions once you receive the notification. We appreciate your patience and interest in our products. Have a great day!"
          }
        ]
      },
      {
        "id": 17,
        "subject": "Shipping to International Address",
        "description": "Do you ship to Australia? If so, what are the shipping costs?",
        "priority": "medium",
        "status": "pending",
        "comments": [
          {
            "author": "customer",
            "content": "Hi there, I'm interested in purchasing some of your kitchenware, but I live in Australia. Do you ship internationally, and if so, what are the shipping costs to Australia?"
          },
          {
            "author": "agent",
            "content": "Hello! Thank you for your interest in our products. Yes, we do ship to Australia. The shipping cost depends on the weight and dimensions of the package, as well as the specific delivery address in Australia. Could you tell me which items you're interested in purchasing? This will help me provide you with a more accurate shipping estimate."
          },
          {
            "author": "customer",
            "content": "I'm looking at buying a set of your stainless steel cookware and a chef's knife."
          },
          {
            "author": "agent",
            "content": "Thank you for providing that information. For a typical stainless steel cookware set and a chef's knife shipping to Australia, the estimated shipping cost would be around $50-$75 USD. However, this is just an estimate. The exact cost can be calculated at checkout when you enter your specific address. Also, please note that there may be additional customs duties or taxes imposed by Australian customs, which would be the responsibility of the recipient."
          },
          {
            "author": "customer",
            "content": "I see. Is there a way to get a more exact estimate before I go through the checkout process?"
          },
          {
            "author": "agent",
            "content": "Certainly! I can help you get a more precise estimate. Could you please provide me with the specific product codes for the cookware set and chef's knife you're interested in, along with your city and postal code in Australia? With this information, I can use our shipping calculator to give you a more accurate quote."
          },
          {
            "author": "customer",
            "content": "The cookware set is SS-500 and the chef's knife is KN-100. My postal code is 2000, and I'm in Sydney."
          },
          {
            "author": "agent",
            "content": "Thank you for those details. I've used our shipping calculator with the information you provided, and I can give you a more accurate estimate now. The shipping cost to Sydney (postal code 2000) for the SS-500 cookware set and KN-100 chef's knife would be $62.50 USD. This includes insurance and tracking. The estimated delivery time is 7-10 business days. Would you like me to provide information about our international return policy as well?"
          }
        ]
      },
      {
        "id": 18,
        "subject": "Care Instructions for Wooden Utensils",
        "description": "I just bought a set of your wooden spoons. How should I care for them to ensure they last?",
        "priority": "low",
        "status": "closed",
        "comments": [
          {
            "author": "customer",
            "content": "Hello, I recently purchased a set of your wooden spoons. Could you provide some care instructions to help them last longer?"
          },
          {
            "author": "agent",
            "content": "Hello! I'm happy to help you with care instructions for your new wooden spoons. Proper care will indeed help them last longer and stay in great condition. Here are some key tips:"
          },
          {
            "author": "agent",
            "content": "1. Hand wash only: Never put wooden utensils in the dishwasher as the heat and harsh detergents can damage the wood.\n2. Wash promptly after use: Don't let food residue sit on the wood.\n3. Use mild soap and warm water: Avoid harsh chemicals.\n4. Dry immediately: Don't let wooden utensils air dry; pat them dry with a clean towel.\n5. Oil occasionally: Every few months, rub with food-grade mineral oil to prevent drying and cracking.\n6. Avoid soaking: Don't leave wooden utensils in water for extended periods.\n7. Store in a dry place: Keep them away from heat sources and excess moisture."
          },
          {
            "author": "customer",
            "content": "Thank you, that's very helpful. I didn't know about oiling them. How often should I do that?"
          },
          {
            "author": "agent",
            "content": "You're welcome! I'm glad you found the information helpful. Regarding oiling, it depends on how frequently you use the utensils. For regular use, oiling every 3-4 months is generally sufficient. However, if you notice the wood looking dry or feeling rough, you can oil them more frequently. Just remember to use food-grade mineral oil, as some other oils can go rancid over time."
          },
          {
            "author": "customer",
            "content": "Great, thanks for the clarification. I'll make sure to follow these instructions."
          },
          {
            "author": "agent",
            "content": "You're very welcome! I'm happy I could help. By following these care instructions, your wooden spoons should serve you well for many years. If you have any more questions about caring for your kitchenware, don't hesitate to ask. Enjoy cooking with your new wooden spoons!"
          }
        ]
      },
      {
        "id": 19,
        "subject": "Broken Glass Lid",
        "description": "The glass lid for my casserole dish arrived broken. Can I get a replacement?",
        "priority": "high",
        "status": "open",
        "comments": [
          {
            "author": "customer",
            "content": "I just received my order, but unfortunately, the glass lid for the casserole dish is broken. Is it possible to get a replacement?"
          },
          {
            "author": "agent",
            "content": "I'm very sorry to hear that the glass lid arrived broken. We certainly want to make this right for you. I'd be happy to arrange a replacement. Could you please provide your order number so I can locate your purchase in our system?"
          },
          {
            "author": "customer",
            "content": "Of course, my order number is CD-7890."
          },
          {
            "author": "agent",
            "content": "Thank you for providing your order number. I've located your purchase in our system. I'm very sorry again for the inconvenience. I'll arrange for a replacement lid to be sent out to you right away at no cost. Could you please confirm that the shipping address on the order is still correct?"
          },
          {
            "author": "customer",
            "content": "Yes, the shipping address is still correct. How long will it take for the replacement to arrive?"
          },
          {
            "author": "agent",
            "content": "I'm glad the address is correct. We'll ship out the replacement lid via express shipping, so you should receive it within 2-3 business days. I'll also email you a tracking number as soon as it's available. Is there anything else you need assistance with regarding this issue?"
          },
          {
            "author": "customer",
            "content": "No, that's all. Thank you for handling this so quickly."
          },
          {
            "author": "agent",
            "content": "You're welcome. We appreciate your understanding, and I'm glad we could resolve this issue promptly. Once you receive the replacement lid, please let us know if everything is in order. If you need any further assistance, don't hesitate to contact us. Thank you for your patience and for choosing our products."
          }
        ]
      },
      {
        "id": 20,
        "subject": "Product Comparison",
        "description": "What's the difference between your standard and professional series chef's knives?",
        "priority": "low",
        "status": "closed",
        "comments": [
          {
            "author": "customer",
            "content": "I'm looking at your chef's knives and I'm wondering what the main differences are between your standard and professional series. Can you help me understand the distinctions?"
          },
          {
            "author": "agent",
            "content": "Of course! I'd be happy to explain the differences between our standard and professional series chef's knives. The main distinctions lie in the materials used, the manufacturing process, and some design features. Let me break it down for you:"
          },
          {
            "author": "agent",
            "content": "1. Material: The standard series uses high-carbon stainless steel, while the professional series uses a higher grade of steel with added molybdenum and vanadium for enhanced durability and edge retention.\n2. Manufacturing: The standard series is stamped, while the professional series is forged, which generally results in a stronger, more balanced knife.\n3. Handle: The standard series has a composite handle, while the professional series features a full tang with triple-riveted ergonomic handles.\n4. Edge: Both are sharp, but the professional series has a hand-honed edge for superior sharpness.\n5. Weight: The professional series is slightly heavier, which some chefs prefer for certain tasks.\n6. Price: The professional series is more expensive due to the higher-grade materials and more intensive manufacturing process."
          },
          {
            "author": "customer",
            "content": "That's really helpful, thank you. In terms of performance, is there a significant difference for a home cook?"
          },
          {
            "author": "agent",
            "content": "For a home cook, both series will perform well for everyday cooking tasks. The standard series is excellent for most home cooks and will last for years with proper care. The professional series offers some advantages in terms of edge retention and durability, which can be beneficial for those who cook frequently or want a higher-end tool. However, the difference in performance might not be noticeable for casual home cooks. The choice often comes down to personal preference, frequency of use, and budget. Would you like me to recommend one based on your cooking habits?"
          },
          {
            "author": "customer",
            "content": "Yes, that would be great. I cook about 4-5 times a week, mostly everyday meals but I do enjoy trying more complex recipes on weekends."
          },
          {
            "author": "agent",
            "content": "Based on your cooking habits, I would recommend our standard series chef's knife. It offers a great balance of quality and value for regular home cooking. It will easily handle your everyday meals and weekend culinary adventures. If you're particularly passionate about cooking and don't mind investing a bit more, the professional series could be a nice treat, but it's not necessary for your current needs. Remember, proper care and regular sharpening are key to maintaining any knife's performance. Would you like more information about either of these knives or our knife care products?"
          },
          {
            "author": "customer",
            "content": "No, I think I have all the information I need. Thanks for your help!"
          },
          {
            "author": "agent",
            "content": "You're welcome! I'm glad I could help you make an informed decision. If you have any more questions as you continue shopping or after you receive your knife, please don't hesitate to reach out. Happy cooking!"
          }
        ]
      },
    {
      "id": 22,
      "subject": "Missing Manual",
      "description": "My new food dehydrator didn't come with a user manual. Can you send me one?",
      "priority": "medium",
      "status": "open"
    },
    {
      "id": 23,
      "subject": "Bulk Order for Restaurant",
      "description": "I'm looking to place a large order for my restaurant. Do you have a commercial sales department?",
      "priority": "high",
      "status": "pending"
    },
    {
      "id": 24,
      "subject": "Dull Knife Sharpening",
      "description": "The chef's knife I bought from you has become dull. Do you offer a sharpening service?",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 25,
      "subject": "Discontinued Item Inquiry",
      "description": "Is the vintage-style tea kettle (item #TK-9876) discontinued? I can't find it on your site anymore.",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 26,
      "subject": "Gift Card Balance Check",
      "description": "How can I check the remaining balance on my gift card?",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 27,
      "subject": "Faulty Pressure Cooker",
      "description": "My new pressure cooker isn't building up pressure. Is this a known issue?",
      "priority": "high",
      "status": "open"
    },
    {
      "id": 28,
      "subject": "Product Material Information",
      "description": "Are your silicone baking mats BPA-free?",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 29,
      "subject": "Loyalty Program Details",
      "description": "I'm a frequent customer. Do you have a loyalty program or rewards system?",
      "priority": "medium",
      "status": "pending"
    },
    {
      "id": 30,
      "subject": "Customization Options",
      "description": "Can I get a set of wine glasses engraved with a personal message?",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 31,
      "subject": "Wrong Color Dish Set",
      "description": "I ordered the blue dish set but received the green one. How can I exchange it?",
      "priority": "high",
      "status": "open"
    },
    {
      "id": 32,
      "subject": "Product Weight Inquiry",
      "description": "How much does the 12-quart stock pot weigh? I have lifting restrictions.",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 33,
      "subject": "Sale Item Price Discrepancy",
      "description": "The sale price for the toaster oven isn't reflecting in my cart. Can you apply the discount?",
      "priority": "medium",
      "status": "open"
    },
    {
      "id": 34,
      "subject": "Replacement Parts for Mixer",
      "description": "Where can I buy replacement beaters for my stand mixer?",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 35,
      "subject": "Product Use Instructions",
      "description": "How do I properly season my new wok?",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 36,
      "subject": "Bulk Purchase of Disposable Items",
      "description": "Do you sell disposable party plates and cutlery in bulk for large events?",
      "priority": "medium",
      "status": "pending"
    },
    {
      "id": 37,
      "subject": "Damaged Packaging",
      "description": "My order arrived with damaged packaging. Should I be concerned about the product inside?",
      "priority": "medium",
      "status": "open"
    },
    {
      "id": 38,
      "subject": "Product Compatibility",
      "description": "Are your oven mitts compatible with air fryer use?",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 39,
      "subject": "Missing Measuring Spoons",
      "description": "I received my measuring cup set, but the 1/4 teaspoon is missing. Can you send a replacement?",
      "priority": "medium",
      "status": "open"
    },
    {
      "id": 40,
      "subject": "Gift Registry Setup",
      "description": "How do I set up a wedding registry on your website?",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 41,
      "subject": "Product Recall Information",
      "description": "I heard there was a recall on some pressure cookers. Is my model affected?",
      "priority": "high",
      "status": "open"
    },
    {
      "id": 42,
      "subject": "Coupon Code for Newsletter Signup",
      "description": "I signed up for your newsletter but didn't receive the promised 10% off coupon. Can you help?",
      "priority": "low",
      "status": "pending"
    },
    {
      "id": 43,
      "subject": "Knife Sharpening Stone Grit",
      "description": "What grit is your knife sharpening stone? Is it suitable for Japanese knives?",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 44,
      "subject": "Stained Plastic Container",
      "description": "My plastic food storage container is stained from tomato sauce. Any tips for removing the stain?",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 45,
      "subject": "Product Safety Certification",
      "description": "Are your children's plates and utensils BPA-free and FDA approved?",
      "priority": "medium",
      "status": "open"
    },
    {
      "id": 46,
      "subject": "Delayed Refund",
      "description": "I returned an item two weeks ago but haven't received my refund yet. What's the status?",
      "priority": "high",
      "status": "open"
    },
    {
      "id": 47,
      "subject": "Product Comparison: Blenders",
      "description": "What's the main difference between your entry-level and professional-grade blenders?",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 48,
      "subject": "Wholesale Account Setup",
      "description": "I own a small kitchenware shop. How can I set up a wholesale account with your company?",
      "priority": "medium",
      "status": "pending"
    },
    {
      "id": 49,
      "subject": "Product Origin Inquiry",
      "description": "Where are your stainless steel pots and pans manufactured?",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 50,
      "subject": "Damaged Delivery",
      "description": "The box containing my new dinnerware set was crushed during shipping. What should I do?",
      "priority": "high",
      "status": "open"
    },
    {
      "id": 51,
      "subject": "Spatula Melted on Pan",
      "description": "My silicone spatula melted when I used it with a hot pan. Is this covered under warranty?",
      "priority": "medium",
      "status": "open"
    },
    {
      "id": 52,
      "subject": "Gluten-free Bakeware",
      "description": "Do you have any bakeware specifically designed for gluten-free baking?",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 53,
      "subject": "Gift Card Activation Problem",
      "description": "I bought a gift card in-store, but it's not working online. How can I resolve this?",
      "priority": "high",
      "status": "open"
    },
    {
      "id": 54,
      "subject": "Product Dimensions for Cabinet",
      "description": "Can you provide the exact dimensions of the 8-quart slow cooker? I need to ensure it fits in my cabinet.",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 55,
      "subject": "Discontinued Color Option",
      "description": "Is the red color option for your tea kettle discontinued? I can only find blue and black online.",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 56,
      "subject": "Corporate Gift Options",
      "description": "We're looking for corporate gift ideas for our clients. Do you offer any branded kitchenware?",
      "priority": "medium",
      "status": "pending"
    },
    {
      "id": 57,
      "subject": "Peeler Blade Replacement",
      "description": "The blade on my vegetable peeler has gone dull. Can I buy a replacement blade?",
      "priority": "low",
      "status": "closed"
    },
    {
      "id": 58,
      "subject": "Microwave-safe Products",
      "description": "Which of your food storage containers are microwave-safe?",
      "priority": "low",
      "status": "closed"
    },
{
    "id": 59,
    "subject": "Damaged Non-stick Coating",
    "description": "The non-stick coating on my frying pan is peeling. Is this covered under warranty?",
    "priority": "high",
    "status": "open"
  },
  {
    "id": 60,
    "subject": "Bulk Discount on Utensils",
    "description": "I'm outfitting a large commercial kitchen. Do you offer bulk discounts on utensils?",
    "priority": "medium",
    "status": "pending"
  },
  {
    "id": 61,
    "subject": "Product Weight Capacity",
    "description": "What's the maximum weight capacity for your kitchen scale?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 62,
    "subject": "Replacement Lid for Blender",
    "description": "I lost the lid to my blender. Can I purchase a replacement?",
    "priority": "medium",
    "status": "open"
  },
  {
    "id": 63,
    "subject": "Gift Ideas for Home Chef",
    "description": "I'm looking for a gift for an aspiring home chef. Any recommendations in the $100 range?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 64,
    "subject": "Product Compatibility with Gas Stove",
    "description": "Are your copper-bottom pots suitable for use on a gas stove?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 65,
    "subject": "Missing Instruction Booklet",
    "description": "My new rice cooker didn't come with an instruction booklet. Can you send me one?",
    "priority": "medium",
    "status": "open"
  },
  {
    "id": 66,
    "subject": "Knife Set Sharpening Service",
    "description": "Do you offer a sharpening service for knife sets purchased from your store?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 67,
    "subject": "Product Availability in Store",
    "description": "Is the Chef's Choice waffle maker available in your physical stores or only online?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 68,
    "subject": "Incorrect Pricing on Website",
    "description": "The price for the pasta maker on your website doesn't match the price in my cart. Can you honor the lower price?",
    "priority": "high",
    "status": "open"
  },
  {
    "id": 69,
    "subject": "Return Without Original Packaging",
    "description": "I want to return a set of mixing bowls but I've discarded the original packaging. Is this possible?",
    "priority": "medium",
    "status": "pending"
  },
  {
    "id": 70,
    "subject": "Product Material Safety",
    "description": "Are your non-stick pans PFOA and PTFE free?",
    "priority": "medium",
    "status": "open"
  },
  {
    "id": 71,
    "subject": "Bulk Order for Culinary School",
    "description": "I'm looking to place a large order of kitchen tools for our culinary school. Do you offer educational discounts?",
    "priority": "high",
    "status": "pending"
  },
  {
    "id": 72,
    "subject": "Customized Engraving on Cutlery",
    "description": "Can I get a set of steak knives engraved with our family name?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 73,
    "subject": "Product Comparison: Food Processors",
    "description": "What's the main difference between your 7-cup and 11-cup food processors?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 74,
    "subject": "Delayed Shipping Notification",
    "description": "I placed an order 3 days ago but haven't received a shipping notification. Is there a delay?",
    "priority": "medium",
    "status": "open"
  },
  {
    "id": 75,
    "subject": "Product Care Instructions",
    "description": "How should I clean and maintain my new carbon steel wok?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 76,
    "subject": "Replacement Parts for Coffee Maker",
    "description": "The carafe for my coffee maker broke. Can I order a replacement part?",
    "priority": "medium",
    "status": "open"
  },
  {
    "id": 77,
    "subject": "Product Compatibility with 220V",
    "description": "I'm moving overseas. Which of your small appliances are compatible with 220V power?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 78,
    "subject": "Bulk Purchase of Disposable Baking Molds",
    "description": "Do you sell disposable aluminum baking molds in bulk for a bakery?",
    "priority": "medium",
    "status": "pending"
  },
  {
    "id": 79,
    "subject": "Product Warranty Clarification",
    "description": "What's covered under the warranty for your high-end blenders?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 80,
    "subject": "Missing Accessory in Package",
    "description": "My new stand mixer is missing the dough hook. Can you send the missing part?",
    "priority": "high",
    "status": "open"
  },
  {
    "id": 81,
    "subject": "Gift Wrapping for Multiple Items",
    "description": "I'm buying several items as gifts. Can each item be gift wrapped separately?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 82,
    "subject": "Product Recommendation for Small Kitchen",
    "description": "I have a very small kitchen. What space-saving appliances do you recommend?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 83,
    "subject": "Discontinued Product Inquiry",
    "description": "Is the retro-style toaster (model RT-500) discontinued? I can't find it on your website.",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 84,
    "subject": "Incorrect Item Color Received",
    "description": "I ordered a white kettle but received a black one. How can I get this corrected?",
    "priority": "high",
    "status": "open"
  },
  {
    "id": 85,
    "subject": "Product Recommendation for Induction Cooking",
    "description": "I just got an induction cooktop. Which of your cookware sets are fully compatible?",
    "priority": "medium",
    "status": "pending"
  },
  {
    "id": 86,
    "subject": "Bulk Order of Catering Supplies",
    "description": "I'm starting a catering business. Do you offer bulk pricing on serving platters and chafing dishes?",
    "priority": "high",
    "status": "open"
  },
  {
    "id": 87,
    "subject": "Product Material for Allergies",
    "description": "I have a nickel allergy. Which of your utensils are nickel-free?",
    "priority": "medium",
    "status": "open"
  },
  {
    "id": 88,
    "subject": "Replacement Charger for Electric Corkscrew",
    "description": "I lost the charger for my electric corkscrew. Can I purchase a replacement?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 89,
    "subject": "Product Comparison: Dutch Ovens",
    "description": "What's the difference between your enameled and non-enameled Dutch ovens?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 90,
    "subject": "Eco-friendly Packaging Options",
    "description": "Do you offer any eco-friendly packaging options for your products?",
    "priority": "medium",
    "status": "pending"
  },
  {
    "id": 91,
    "subject": "Product Compatibility with Dishwasher",
    "description": "Which of your non-stick pans are dishwasher safe?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 92,
    "subject": "Missing Product in Multi-Item Order",
    "description": "I received my order but one item is missing. How can I get the missing item sent?",
    "priority": "high",
    "status": "open"
  },
  {
    "id": 93,
    "subject": "Product Recommendation for Baking Enthusiast",
    "description": "My daughter is getting into baking. What essential tools would you recommend for a beginner?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 94,
    "subject": "Bulk Purchase for Restaurant Chain",
    "description": "We're opening a chain of restaurants and need to outfit all our kitchens. Do you handle large commercial orders?",
    "priority": "high",
    "status": "pending"
  },
  {
    "id": 95,
    "subject": "Product Use in Commercial Kitchen",
    "description": "Are your home-use blenders suitable for light commercial use in a small café?",
    "priority": "medium",
    "status": "open"
  },
  {
    "id": 96,
    "subject": "Replacement Gasket for Pressure Cooker",
    "description": "The gasket on my pressure cooker is worn out. How can I order a replacement?",
    "priority": "medium",
    "status": "open"
  },
  {
    "id": 97,
    "subject": "Product Weight for Shipping Calculation",
    "description": "What's the shipping weight of the 16-piece dinnerware set? I need to calculate international shipping costs.",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 98,
    "subject": "Gift Card Expiration Policy",
    "description": "Do your gift cards have an expiration date? I found an old one and wonder if it's still valid.",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 99,
    "subject": "Product Recommendation for Camping",
    "description": "I'm looking for durable, lightweight cookware for camping. What do you recommend?",
    "priority": "low",
    "status": "closed"
  },
  {
    "id": 100,
    "subject": "Bulk Order of Disposable Party Supplies",
    "description": "I'm planning a large outdoor event. Do you sell disposable plates, cups, and cutlery in bulk?",
    "priority": "medium",
    "status": "pending"
  }
]